# LeftButtonC

## Description
This constant is used as a control ID when a button must appear in the lower left corner of a dialog.

```pascal
PROCEDURE LeftButtonC;
```

```python
def vs.LeftButtonC():
    return INTEGER
```

## Remarks
Added 10/30/09 by Adam Petrone.

## Examples
```pascal
LeftButtonC;
```
```python
import vs

# This constant is used as a control ID when a button must appear in the
# lower left corner of a dialog.
resultN = vs.LeftButtonC()
vs.Message('LeftButtonC returned: ' + str(resultN))
```

## Version
Availability: from Vectorworks 2011

## Category
* Dialogs - Modern